# ViewDisplaySketchyLines Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplaySketchyLines Class
Members See Also
---
Represents the settings for sketchy lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ViewDisplaySketchyLines : IDisposable
```

Visual Basic
---
```text
Public Class ViewDisplaySketchyLines _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ViewDisplaySketchyLines : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ViewDisplaySketchyLines
# See Also
ViewDisplaySketchyLines Members
Autodesk.Revit.DB Namespace